cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233E6PM.svd.xml
        <register>
          <name>CHMAP3</name>
          <description>DMA Channel Map Select 3</description>
          <addressOffset>0x0000051C</addressOffset>
          <fields>
            <field>
              <name>UDMA_CHMAP3_CH24SEL</name>
              <description>uDMA Channel 24 Source Select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH25SEL</name>
              <description>uDMA Channel 25 Source Select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH26SEL</name>
              <description>uDMA Channel 26 Source Select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH27SEL</name>
              <description>uDMA Channel 27 Source Select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH28SEL</name>
              <description>uDMA Channel 28 Source Select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH29SEL</name>
              <description>uDMA Channel 29 Source Select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH30SEL</name>
              <description>uDMA Channel 30 Source Select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>UDMA_CHMAP3_CH31SEL</name>
              <description>uDMA Channel 31 Source Select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for TM4C1233E6PM</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00020000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>ROM</name>
      <description>ROM Memory Map for TM4C1233E6PM</description>
      <baseAddress>0x01000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008c00</size>
        <usage>ROM Boot Loader/TivaWare</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for TM4C1233E6PM</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00008000</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
